thisdev/bitSolarMonitor/sdkconfig.defaults
# --- Board: Waveshare ESP32-S3-Touch-AMOLED-1.8 (ESP32-S3R8, 16 MB Flash) ---
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# 8 MB embedded PSRAM des ESP32-S3R8 -> oktal. Ohne das kein LVGL.
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

CONFIG_FREERTOS_HZ=1000
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# app_main baut die Oberflaeche auf und stoesst die Geraetesuche an --
# beides mit HTTP dahinter. Die Standardgroesse ist dafuer zu knapp.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=6144

# Erlaubt Bildschirmaufnahmen fuer die Dokumentation
CONFIG_LV_USE_SNAPSHOT=y
